/* Sidebar (MainWindow) */
"Overview" = "Resumen";
"Applications" = "Aplicaciones";
"Cleanup" = "Limpieza";
"Dashboard" = "Panel";
"Installed Apps" = "Apps instaladas";
"Orphaned Files" = "Archivos huérfanos";
"MClean" = "MClean";
"Ready to clean" = "Listo para limpiar";
"Limited access" = "Acceso limitado";
"Full Disk Access granted" = "Acceso total al disco concedido";
"Grant FDA in Settings" = "Concede el acceso en Ajustes";
"Select a category from the sidebar to get started." = "Selecciona una categoría en la barra lateral para empezar.";

/* FDA toast + clean error alert (MainWindow) */
"Couldn't clean everything" = "No se pudo limpiar todo";
"Open System Settings" = "Abrir Ajustes del Sistema";
"OK" = "OK";
"Full Disk Access required" = "Se requiere acceso total al disco";
"macOS blocks MClean from cleaning caches and uninstalling apps until you grant access." = "macOS impide que MClean limpie cachés y desinstale apps hasta que concedas el acceso.";
"Grant Access" = "Conceder acceso";

/* Dashboard */
"Storage" = "Almacenamiento";
"Smart Scan" = "Análisis inteligente";
"free of %@" = "libres de %@";
"%lld%% used" = "%lld%% en uso";
"Used" = "En uso";
"Junk" = "Basura";
"Purgeable" = "Liberable";
"USED" = "EN USO";
"SCANNING" = "ANALIZANDO";
"Free Space" = "Espacio libre";
"Junk Found" = "Basura encontrada";
"Apps" = "Apps";
"of %@ · %lld%% used" = "de %@ · %lld%% en uso";
"Run a scan" = "Realiza un análisis";
"across %lld categories" = "en %lld categorías";
"installed" = "instaladas";
"APFS reclaimable" = "Recuperable por APFS";
"Suggested for you" = "Sugerencias para ti";
"Found so far" = "Encontrado hasta ahora";
"By category" = "Por categoría";
"%@ is using %@" = "%@ está usando %@";
"Grant Full Disk Access for full results" = "Concede acceso total al disco para obtener resultados completos";
"Without it, most caches and uninstall flows fail." = "Sin él, la mayoría de cachés y desinstalaciones fallan.";
"Action" = "Acción";
"Scanning your Mac" = "Analizando tu Mac";
"Currently in: %@" = "Actualmente en: %@";
"found" = "encontrado";
"Your Mac is clean" = "Tu Mac está limpio";
"Scan Again" = "Volver a analizar";
"Clean %@" = "Limpiar %@";
"Clean %@?" = "¿Limpiar %@?";
"Cleaning…" = "Limpiando…";
"%lld%% complete" = "%lld%% completado";
"freed" = "liberado";
"Done" = "Listo";
"%lld items" = "%lld elementos";

/* Common destructive dialog */
"Clean" = "Limpiar";
"Cancel" = "Cancelar";
"This will permanently delete the selected files. This cannot be undone." = "Esto eliminará permanentemente los archivos seleccionados. No se puede deshacer.";

/* Category Detail */
"All Clean" = "Todo limpio";
"No junk files found in this category." = "No se encontraron archivos basura en esta categoría.";
"Not Scanned" = "Sin analizar";
"Run a scan to analyze this category." = "Realiza un análisis para evaluar esta categoría.";
"Scan Now" = "Analizar ahora";
"Filter files" = "Filtrar archivos";
"Scan" = "Analizar";
"Select All" = "Seleccionar todo";
"Deselect All" = "Deseleccionar todo";
"Largest First" = "Más grandes primero";
"Smallest First" = "Más pequeños primero";
"Sorted: Largest First" = "Orden: más grandes primero";
"Sorted: Smallest First" = "Orden: más pequeños primero";
"Clean %lld items" = "Limpiar %lld elementos";
"%lld items · %@" = "%lld elementos · %@";
"Scanning…" = "Analizando…";
"Rescan" = "Volver a analizar";
"%lld of %lld selected" = "%lld de %lld seleccionados";
"Reveal in Finder" = "Mostrar en el Finder";
"Copy Path" = "Copiar ruta";
"Move to Trash" = "Mover a la Papelera";

/* Apps (AppListView) */
"Search apps" = "Buscar apps";
"Refresh" = "Actualizar";
"Installed Apps (%lld)" = "Apps instaladas (%lld)";
"Loading installed apps..." = "Cargando apps instaladas...";
"No Apps Found" = "No se encontraron apps";
"Could not find any installed applications." = "No se pudo encontrar ninguna app instalada.";
"Retry" = "Reintentar";
"Application" = "Aplicación";
"Size" = "Tamaño";
"Select an App" = "Selecciona una app";
"Select an app from the list to see all its related files across your system." = "Selecciona una app de la lista para ver todos sus archivos relacionados en el sistema.";

/* App Files (AppFilesView) */
"%lld files" = "%lld archivos";
"Scanning for related files..." = "Buscando archivos relacionados...";
"Checking %lld locations..." = "Revisando %lld ubicaciones...";
"No Related Files" = "Sin archivos relacionados";
"No additional files found for %@." = "No se encontraron archivos adicionales para %@.";
"Remove %lld files (%@)" = "Eliminar %lld archivos (%@)";
"Removal Failed" = "No se pudo eliminar";
"Remove this file" = "Eliminar este archivo";
"Remove %@?" = "¿Eliminar %@?";
"Remove" = "Eliminar";
"This will permanently delete this file. This action cannot be undone." = "Esto eliminará permanentemente este archivo. Esta acción no se puede deshacer.";

/* Orphans */
"Scanning for orphaned files..." = "Buscando archivos huérfanos...";
"No Orphaned Files" = "Sin archivos huérfanos";
"No leftover files from uninstalled apps were found." = "No se encontraron archivos sobrantes de apps desinstaladas.";
"Scan for Orphans" = "Buscar huérfanos";
"Orphaned Files (%lld)" = "Archivos huérfanos (%lld)";
"Remove Selected (%lld)" = "Eliminar seleccionados (%lld)";
"Some files could not be removed" = "Algunos archivos no se pudieron eliminar";

/* Onboarding */
"Back" = "Atrás";
"Next" = "Siguiente";
"Get Started" = "Empezar";
"Welcome to MClean" = "Te damos la bienvenida a MClean";
"Free, open-source macOS app manager and system cleaner." = "Administrador de apps y limpiador de sistema gratuito y de código abierto para macOS.";
"Find junk files across your system" = "Encuentra archivos basura en todo el sistema";
"App Uninstaller" = "Desinstalador de apps";
"Remove apps and all their files" = "Elimina apps y todos sus archivos";
"Orphan Finder" = "Buscador de huérfanos";
"Find leftovers from deleted apps" = "Encuentra restos de apps eliminadas";
"Full Disk Access" = "Acceso total al disco";
"MClean needs Full Disk Access to uninstall apps, find leftover files, and clean protected caches." = "MClean necesita acceso total al disco para desinstalar apps, encontrar archivos sobrantes y limpiar cachés protegidas.";
"We'll guide you through the next steps." = "Te guiaremos por los siguientes pasos.";
"In System Settings, do this:" = "En Ajustes del Sistema, haz lo siguiente:";
"Privacy & Security → Full Disk Access" = "Privacidad y seguridad → Acceso total al disco";
"Find **MClean** and turn the toggle on" = "Encuentra **MClean** y activa el interruptor";
"Authenticate with Touch ID or your password" = "Autentícate con Touch ID o tu contraseña";
"Reopen Settings" = "Reabrir Ajustes";
"MClean isn't in the list — reveal it" = "MClean no aparece en la lista: mostrarlo";
"Reset permissions and re-prompt" = "Restablecer permisos y volver a solicitar";
"Hide diagnostics" = "Ocultar diagnóstico";
"Show diagnostics" = "Mostrar diagnóstico";
"Trouble?" = "¿Problemas?";
"Waiting for permission…" = "Esperando permiso…";
"Permission granted." = "Permiso concedido.";
"MClean can now manage protected files." = "MClean ahora puede gestionar archivos protegidos.";
"You're Ready" = "Todo listo";
"%lld/%lld protected locations accessible" = "%lld/%lld ubicaciones protegidas accesibles";
"Some features will be limited. You can grant Full Disk Access later in System Settings." = "Algunas funciones serán limitadas. Puedes conceder el acceso total al disco más tarde en Ajustes del Sistema.";
"Trash" = "Papelera";
"Mail Data" = "Datos de Mail";
"Safari Data" = "Datos de Safari";
"Desktop" = "Escritorio";
"Documents" = "Documentos";
"TCC Database" = "Base de datos TCC";
"Blocked" = "Bloqueado";

/* Settings */
"General" = "General";
"Cleaning" = "Limpieza";
"Schedule" = "Programación";
"About" = "Acerca de";
"Startup" = "Inicio";
"Launch MClean at login" = "Abrir MClean al iniciar sesión";
"App Scanning" = "Análisis de apps";
"Search sensitivity" = "Sensibilidad de búsqueda";
"Strict" = "Estricta";
"Enhanced" = "Mejorada";
"Deep" = "Profunda";
"Exact bundle ID and name matches only. Safest option." = "Solo coincidencias exactas de ID de paquete y nombre. La opción más segura.";
"Includes partial name matching and bundle ID components." = "Incluye coincidencias parciales de nombre y componentes del ID de paquete.";
"Includes company name, entitlements, and team identifier matching." = "Incluye coincidencias con nombre de empresa, autorizaciones e identificador de equipo.";
"Language" = "Idioma";
"Restart MClean to apply the selected language." = "Reinicia MClean para aplicar el idioma seleccionado.";
"Relaunch Now" = "Reiniciar ahora";
"System Default" = "Predeterminado del sistema";
"English" = "Inglés";
"Spanish" = "Español";
"Japanese" = "Japonés";
"Arabic" = "Árabe";
"Portuguese (Brazil)" = "Portugués (Brasil)";
"Chinese (Simplified)" = "Chino (simplificado)";
"Chinese (Traditional)" = "Chino (tradicional)";
"Safety" = "Seguridad";
"Confirm before deleting files" = "Confirmar antes de eliminar archivos";
"File Discovery" = "Detección de archivos";
"Skip hidden files during scan" = "Omitir archivos ocultos al analizar";
"Large Files" = "Archivos grandes";
"Minimum size: %lld MB" = "Tamaño mínimo: %lld MB";
"Files older than: %lld months" = "Archivos con más de: %lld meses";
"Automatic Scanning" = "Análisis automático";
"Enable scheduled scanning" = "Activar análisis programado";
"Scan interval" = "Intervalo de análisis";
"Auto-clean after scan" = "Limpiar automáticamente tras el análisis";
"Auto-purge purgeable space" = "Purgar automáticamente el espacio liberable";
"Notify on completion" = "Notificar al finalizar";
"Last run" = "Última ejecución";
"Version %@" = "Versión %@";
"Free, open-source macOS app manager." = "Administrador de apps de macOS gratuito y de código abierto.";
"GitHub Repository" = "Repositorio de GitHub";
"Report an Issue" = "Informar de un problema";
"MIT License" = "Licencia MIT";

/* Cleaning categories (CleaningCategory.rawValue) */
"System Junk" = "Basura del sistema";
"User Cache" = "Caché de usuario";
"AI Apps" = "Apps de IA";
"Mail Files" = "Archivos de Mail";
"Trash Bins" = "Papeleras";
"Large & Old Files" = "Archivos grandes y antiguos";
"Purgeable Space" = "Espacio liberable";
"Xcode Junk" = "Basura de Xcode";
"Brew Cache" = "Caché de Brew";
"Node Cache" = "Caché de Node";
"Docker Cache" = "Caché de Docker";

/* Cleaning category descriptions */
"Scan everything at once" = "Analizar todo a la vez";
"System caches, logs, and temporary files" = "Cachés del sistema, registros y archivos temporales";
"Application caches and browser data" = "Cachés de aplicaciones y datos del navegador";
"Local AI app logs, caches, and optional history" = "Registros, cachés e historial opcional de apps de IA locales";
"Downloaded mail attachments" = "Adjuntos de correo descargados";
"Files in your Trash" = "Archivos en la Papelera";
"Files over 100 MB or older than 1 year" = "Archivos de más de 100 MB o con más de 1 año";
"APFS purgeable disk space" = "Espacio liberable de disco APFS";
"Derived data, archives, and simulators" = "Datos derivados, archivos y simuladores";
"Homebrew download cache" = "Caché de descargas de Homebrew";
"npm, yarn, and pnpm download caches" = "Cachés de descargas de npm, yarn y pnpm";
"Docker images, containers, and build cache" = "Imágenes, contenedores y caché de compilación de Docker";

/* Node Cache subcategories */
"npm cache" = "Caché de npm";
"yarn classic cache" = "Caché clásica de yarn";
"pnpm content-addressable store" = "Almacén direccionable de pnpm";

/* Docker Cache helper */
"Reclaimable (run `docker system prune -af`)" = "Recuperable (ejecuta `docker system prune -af`)";

/* Schedule intervals (ScheduleInterval.rawValue) */
"Every Hour" = "Cada hora";
"Every 3 Hours" = "Cada 3 horas";
"Every 6 Hours" = "Cada 6 horas";
"Every 12 Hours" = "Cada 12 horas";
"Daily" = "Diariamente";
"Weekly" = "Semanalmente";
"Every 2 Weeks" = "Cada 2 semanas";
"Monthly" = "Mensualmente";

/* Schedule status */
"Never" = "Nunca";
"Not scheduled" = "Sin programar";

/* Appearance modes (AppearanceMode.label) */
"System" = "Sistema";
"Light" = "Claro";
"Dark" = "Oscuro";

/* Notifications */
"Found %@ of junk files." = "Se encontraron %@ de archivos basura.";

/* Permission Sheet */
"Grant Full Disk Access" = "Conceder acceso a todo el disco";
"%lld item(s) need Full Disk Access" = "%lld elemento(s) necesitan acceso a todo el disco";
"Uninstalling %@: %lld file(s) need Full Disk Access" = "Desinstalando %@: %lld archivo(s) necesitan acceso a todo el disco";
"%lld item(s) need Full Disk Access to remove. Tap Grant Access to fix in one step." = "%lld elemento(s) requieren acceso a todo el disco. Toca Conceder acceso para resolverlo en un paso.";
"Couldn't remove %@%@. They may be in use or protected by macOS." = "No se pudo eliminar %@%@. Pueden estar en uso o protegidos por macOS.";
" and %lld more" = " y %lld más";
"Access granted. Retrying…" = "Acceso concedido. Reintentando…";
"1-tap setup. We'll detect the change automatically." = "Configuración en un toque. Detectaremos el cambio automáticamente.";
"Open Settings & reveal MClean" = "Abrir Ajustes y mostrar MClean";
"We'll open both windows side-by-side." = "Abriremos ambas ventanas lado a lado.";
"Turn on MClean" = "Activar MClean";
"Toggle the row that appears." = "Activa la fila que aparezca.";
"Authenticate" = "Autenticar";
"Touch ID or password." = "Touch ID o contraseña.";
"We auto-retry — no need to come back." = "Reintentamos automáticamente, no necesitas volver.";
"Watching for permission change…" = "Esperando el cambio de permiso…";
"MClean not in the list?" = "¿MClean no aparece en la lista?";
"Hide help" = "Ocultar ayuda";
"Try this if MClean doesn't appear:" = "Prueba esto si MClean no aparece:";
"Reveal app" = "Mostrar app";
"Drag MClean.app into the list" = "Arrastra MClean.app a la lista";
"Reset + reprompt" = "Restablecer y volver a pedir";
"Clear stale TCC entry" = "Borrar entrada antigua de TCC";
"+ %lld more" = "+ %lld más";
"%lld blocked path(s)" = "%lld ruta(s) bloqueada(s)";
"Access granted" = "Acceso concedido";
"Retrying the operation now." = "Reintentando la operación ahora.";
"Skip for now" = "Omitir por ahora";
"I granted it — retry" = "Ya lo concedí - reintentar";

/* Dashboard polish */
"Low space" = "Poco espacio";
"CLEANING" = "LIMPIANDO";
"Quick Setup" = "Configuración rápida";
"1-tap setup. We'll auto-retry what failed." = "Configuración en un toque. Reintentaremos automáticamente lo que falle.";
"Fix permission" = "Arreglar permiso";
"Dismiss" = "Descartar";

/* Onboarding v2 */
"Reclaim your Mac" = "Recupera tu Mac";
"Apple sells you small disks. We help you keep them clean." = "Apple te vende discos pequeños. Te ayudamos a mantenerlos limpios.";
"Free. Open source. MIT licensed." = "Gratis. Código abierto. Licencia MIT.";
"What's inside" = "Qué hay dentro";
"Three things, done well." = "Tres cosas, bien hechas.";
"Find caches, logs, broken installs, and the AI-app history hiding in your library." = "Encuentra cachés, registros, instalaciones rotas y el historial de apps de IA escondido en tu biblioteca.";
"Drag an app, see every file it dropped, remove all of it. No leftovers." = "Arrastra una app, ve cada archivo que dejó, elimínalo todo. Sin sobras.";
"Surfaces files that outlived the apps that created them." = "Encuentra archivos que sobrevivieron a las apps que los crearon.";
"One permission, then we're done" = "Un permiso y listo";
"Permission granted" = "Permiso concedido";
"MClean can now reach the locations macOS protects by default." = "MClean ya puede acceder a las ubicaciones que macOS protege por defecto.";
"macOS hides certain folders from every app until you say otherwise. We need them to find caches and uninstall cleanly." = "macOS oculta ciertas carpetas hasta que tú lo decides. Las necesitamos para encontrar cachés y desinstalar limpiamente.";
"All set — moving you to the next step." = "Todo listo - pasando al siguiente paso.";
"Reveal app again" = "Mostrar app de nuevo";
"Reset permissions" = "Restablecer permisos";
"You're ready" = "Listo";
"Ready when you are" = "Listos cuando lo estés";
"Hit Start to run your first Smart Scan." = "Pulsa Empezar para tu primer Smart Scan.";
"Skip" = "Omitir";
"Start" = "Empezar";
"Continue" = "Continuar";

/* Drag handle */
"Drag to the Settings list" = "Arrastra a la lista de Ajustes";
"Drag this icon into the Full Disk Access list in System Settings." = "Arrastra este icono a la lista de Acceso a Todo el Disco en Ajustes del Sistema.";
"Tip: drag the icon on the left straight into the list." = "Consejo: arrastra el icono de la izquierda directamente a la lista.";
"Or drag the icon on the left straight into Settings." = "O arrastra el icono de la izquierda directamente a Ajustes.";

/* Dashboard storage composition (v2.7.0) */
"Storage composition" = "Composición del almacenamiento";
"total" = "total";
"Free" = "Libre";

/* UI polish (v2.8.0): leftover groups + sound toggle */
"Application" = "Aplicación";
"Caches" = "Cachés";
"Application Support" = "Soporte de aplicaciones";
"Preferences" = "Preferencias";
"Logs" = "Registros";
"Containers" = "Contenedores";
"Launch Agents" = "Agentes de inicio";
"Other Files" = "Otros archivos";
"Sound" = "Sonido";
"Play sound effects" = "Reproducir efectos de sonido";

/* v2.8.1: purgeable honesty */
"Managed by macOS" = "Gestionado por macOS";
"Reserved by macOS - freed automatically when space is needed" = "Reservado por macOS - se libera automáticamente cuando se necesita espacio";

/* v2.8.2: large-file folder exclusions (#121) */
"Excluded Folders" = "Carpetas excluidas";
"Files inside these folders are skipped from the Large & Old Files scan (Downloads, Documents, Desktop)." = "Los archivos dentro de estas carpetas se omiten en el análisis de archivos grandes y antiguos (Descargas, Documentos, Escritorio).";
"Remove from exclusions" = "Quitar de las exclusiones";
"Add Folder…" = "Añadir carpeta…";

/* v2.8.2: orphan ignore list (#114) */
"Always Ignore" = "Ignorar siempre";
"Ignore Selected (%lld)" = "Ignorar seleccionados (%lld)";
"Ignored orphans: %lld" = "Huérfanos ignorados: %lld";
"Forget Ignored" = "Olvidar ignorados";
"Ignored files won't appear in future orphan scans." = "Los archivos ignorados no aparecerán en futuros análisis de huérfanos.";

/* v2.8.3: menu-bar system monitor */
"System Monitor" = "Monitor del sistema";
"Show system monitor in menu bar" = "Mostrar el monitor del sistema en la barra de menús";
"Live CPU, memory, and disk meters in the menu bar. MClean keeps running in the background while this is on." = "Medidores de CPU, memoria y disco en vivo en la barra de menús. MClean sigue ejecutándose en segundo plano mientras esto está activado.";
"CPU" = "CPU";
"Memory" = "Memoria";
"Disk" = "Disco";
"Open MClean" = "Abrir MClean";
"Quit MClean" = "Salir de MClean";

/* Space Lens */
"Space Lens" = "Space Lens";
"See what's taking up space. Scan a folder to map its contents as bubbles you can explore and clean." = "Descubre qué ocupa tu espacio. Analiza una carpeta para ver su contenido como burbujas que puedes explorar y limpiar.";
"Scan Home Folder" = "Analizar carpeta de inicio";
"Choose Folder…" = "Elegir carpeta…";
"%d items" = "%d elementos";
"Stop Scan" = "Detener análisis";
"%d smaller items" = "%d elementos más pequeños";
"Nothing selected" = "Nada seleccionado";
"Selected: %@" = "Seleccionado: %@";
"Move %d items (%@) to the Trash?" = "¿Mover %d elementos (%@) a la papelera?";
"Items can be restored from the Trash." = "Los elementos se pueden restaurar desde la papelera.";
"Access denied" = "Acceso denegado";
"Other" = "Otros";
"Couldn't move some items to the Trash" = "No se pudieron mover algunos elementos a la papelera";

/* FDA relaunch detection */
"Access granted — relaunch to apply" = "Acceso concedido — reinicia para aplicarlo";
"macOS applies Full Disk Access when MClean starts again. Relaunch to finish — takes a second." = "macOS aplica el Acceso total al disco cuando MClean se inicia de nuevo. Reinicia para terminar — tarda un segundo.";
"Relaunch MClean" = "Reiniciar MClean";

/* Donate (About) */
"Buy me a coffee ☕" = "Invítame a un café ☕";
"If MClean is useful to you, a small donation keeps it going. Thank you!" = "Si MClean te resulta útil, una pequeña donación lo mantiene vivo. ¡Gracias!";
"Scan with MoMo or your banking app (VietQR · Napas 247)" = "Escanea con MoMo o tu app bancaria (VietQR · Napas 247)";
